---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemLayoutRuleParam
source: html/d2799b5f-9010-4178-d17a-df5745bb67c7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemLayoutRuleParam Property

"Layout Rule"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemLayoutRuleParam { get; }
```